; domain
;(define )
(define (domain merry_definitions)
	(:requirements :adl)
	(:predicates
		
		(klucz ?kolor ?id) ;kolor/id
		(drzwi ?kolor ?skad ?dokad) ;kolor/kierunek/id
		(pokoj ?id ?klucz) ;id
		(merryKlucz ?kolorKlucza ?idKlucza) ;czy ma klucz o id "y" kolor/id
		(merryPozycja ?id) ;id pokoju w ktorym jest
	)
	
	(:action wez_klucz
		:parameters (?pozycjaMerry ?jakiKlucz ?jakiKolorKlucza)
		:precondition 
		(and
			(merryPozycja ?pozycjaMerry)
			(pokoj ?pozycjaMerry ?jakiKlucz)
			(klucz ?jakiKolorKlucza ?jakiKlucz)
		)
		:effect
		(and
			(merryKlucz ?jakiKolorKlucza ?jakiKlucz)
			(not (pokoj ?pozycjaMerry ?jakiKlucz))
		)
	)
	
	(:action przejdz
		:parameters (?skad ?dokad ?klucz ?kolorKlucza)
		:precondition 
		(and
			(merryPozycja ?skad)
			(merryKlucz ?kolorKlucza ?klucz)
			(drzwi ?kolorKlucza ?skad ?dokad)
		)
		:effect
		(and
			(merryPozycja ?dokad)
			(not (merryPozycja ?skad))
			(not (merryKlucz ?kolorKlucza ?klucz))
		)
	)
)

; problem
(define (problem merry_problem)
(:domain merry_definitions)
(:objects 
pokoj1 pokoj2 pokoj3 pokoj4 pokoj5 pokoj6 pokoj7 pokoj8 pokoj9
klucz1 klucz2 klucz3 klucz4 klucz5 klucz6 klucz7 klucz8 klucz9 klucz10 klucz11 klucz12 klucz13 klucz14
zolty fioletowy zielony niebieski czerwony
drzwi12 drzwi13 drzwi24 drzwi35 drzwi46 drzwi56 drzwi57 drzwi68 drzwi78 drzwi69
)
(:init
(pokoj pokoj1 klucz1)
(pokoj pokoj2 klucz2)
(pokoj pokoj3 klucz3)
(pokoj pokoj3 klucz4)
(pokoj pokoj4 klucz5)
(pokoj pokoj4 klucz6)
(pokoj pokoj5 klucz7)
(pokoj pokoj5 klucz8)
(pokoj pokoj6 klucz9)
(pokoj pokoj6 klucz10)
(pokoj pokoj7 klucz11)
(pokoj pokoj7 klucz12)
(pokoj pokoj8 klucz13)
(pokoj pokoj8 klucz14)

(klucz zolty klucz1)
(klucz fioletowy klucz2)
(klucz zielony klucz3)
(klucz niebieski klucz4)
(klucz zolty klucz5)
(klucz czerwony klucz6)
(klucz niebieski klucz7)
(klucz zolty klucz8)
(klucz niebieski klucz9)
(klucz niebieski klucz10)
(klucz zolty klucz11)
(klucz czerwony klucz12)
(klucz zielony klucz13)
(klucz niebieski klucz14) 

(drzwi zielony pokoj1 pokoj2)
(drzwi czerwony pokoj1 pokoj3)
(drzwi czerwony pokoj3 pokoj1)
(drzwi zielony pokoj2 pokoj4)
(drzwi zolty pokoj3 pokoj5)
(drzwi zolty pokoj5 pokoj3)
(drzwi zolty pokoj4 pokoj6)
(drzwi zolty pokoj6 pokoj4)
(drzwi niebieski pokoj5 pokoj6)
(drzwi niebieski pokoj6 pokoj5)
(drzwi fioletowy pokoj6 pokoj9)
(drzwi czerwony pokoj5 pokoj7)
(drzwi czerwony pokoj7 pokoj5)
(drzwi niebieski pokoj6 pokoj8)
(drzwi niebieski pokoj8 pokoj6)
(drzwi niebieski pokoj7 pokoj8)
(drzwi niebieski pokoj8 pokoj7)

(merryPozycja pokoj6)
)
(:goal
(merryPozycja pokoj9) 
))

; plan
1. (wez_klucz pokoj6 klucz10 niebieski)
   deleted: (pokoj pokoj6 klucz10)
   added: (merryklucz niebieski klucz10)
   goals met: 0 of 1
2. (przejdz pokoj6 pokoj5 klucz10 niebieski)
   deleted: (merrypozycja pokoj6) (merryklucz niebieski klucz10)
   added: (merrypozycja pokoj5)
   goals met: 0 of 1
3. (wez_klucz pokoj5 klucz7 niebieski)
   deleted: (pokoj pokoj5 klucz7)
   added: (merryklucz niebieski klucz7)
   goals met: 0 of 1
4. (wez_klucz pokoj5 klucz8 zolty)
   deleted: (pokoj pokoj5 klucz8)
   added: (merryklucz zolty klucz8)
   goals met: 0 of 1
5. (przejdz pokoj5 pokoj6 klucz7 niebieski)
   deleted: (merrypozycja pokoj5) (merryklucz niebieski klucz7)
   added: (merrypozycja pokoj6)
   goals met: 0 of 1
6. (wez_klucz pokoj6 klucz9 niebieski)
   deleted: (pokoj pokoj6 klucz9)
   added: (merryklucz niebieski klucz9)
   goals met: 0 of 1
7. (przejdz pokoj6 pokoj4 klucz8 zolty)
   deleted: (merrypozycja pokoj6) (merryklucz zolty klucz8)
   added: (merrypozycja pokoj4)
   goals met: 0 of 1
8. (wez_klucz pokoj4 klucz6 czerwony)
   deleted: (pokoj pokoj4 klucz6)
   added: (merryklucz czerwony klucz6)
   goals met: 0 of 1
9. (wez_klucz pokoj4 klucz5 zolty)
   deleted: (pokoj pokoj4 klucz5)
   added: (merryklucz zolty klucz5)
   goals met: 0 of 1
10. (przejdz pokoj4 pokoj6 klucz5 zolty)
   deleted: (merrypozycja pokoj4) (merryklucz zolty klucz5)
   added: (merrypozycja pokoj6)
   goals met: 0 of 1
11. (przejdz pokoj6 pokoj8 klucz9 niebieski)
   deleted: (merrypozycja pokoj6) (merryklucz niebieski klucz9)
   added: (merrypozycja pokoj8)
   goals met: 0 of 1
12. (wez_klucz pokoj8 klucz14 niebieski)
   deleted: (pokoj pokoj8 klucz14)
   added: (merryklucz niebieski klucz14)
   goals met: 0 of 1
13. (wez_klucz pokoj8 klucz13 zielony)
   deleted: (pokoj pokoj8 klucz13)
   added: (merryklucz zielony klucz13)
   goals met: 0 of 1
14. (przejdz pokoj8 pokoj7 klucz14 niebieski)
   deleted: (merrypozycja pokoj8) (merryklucz niebieski klucz14)
   added: (merrypozycja pokoj7)
   goals met: 0 of 1
15. (wez_klucz pokoj7 klucz12 czerwony)
   deleted: (pokoj pokoj7 klucz12)
   added: (merryklucz czerwony klucz12)
   goals met: 0 of 1
16. (wez_klucz pokoj7 klucz11 zolty)
   deleted: (pokoj pokoj7 klucz11)
   added: (merryklucz zolty klucz11)
   goals met: 0 of 1
17. (przejdz pokoj7 pokoj5 klucz12 czerwony)
   deleted: (merrypozycja pokoj7) (merryklucz czerwony klucz12)
   added: (merrypozycja pokoj5)
   goals met: 0 of 1
18. (przejdz pokoj5 pokoj3 klucz11 zolty)
   deleted: (merrypozycja pokoj5) (merryklucz zolty klucz11)
   added: (merrypozycja pokoj3)
   goals met: 0 of 1
19. (wez_klucz pokoj3 klucz3 zielony)
   deleted: (pokoj pokoj3 klucz3)
   added: (merryklucz zielony klucz3)
   goals met: 0 of 1
20. (przejdz pokoj3 pokoj1 klucz6 czerwony)
   deleted: (merrypozycja pokoj3) (merryklucz czerwony klucz6)
   added: (merrypozycja pokoj1)
   goals met: 0 of 1
21. (wez_klucz pokoj1 klucz1 zolty)
   deleted: (pokoj pokoj1 klucz1)
   added: (merryklucz zolty klucz1)
   goals met: 0 of 1
22. (przejdz pokoj1 pokoj2 klucz13 zielony)
   deleted: (merrypozycja pokoj1) (merryklucz zielony klucz13)
   added: (merrypozycja pokoj2)
   goals met: 0 of 1
23. (wez_klucz pokoj2 klucz2 fioletowy)
   deleted: (pokoj pokoj2 klucz2)
   added: (merryklucz fioletowy klucz2)
   goals met: 0 of 1
24. (przejdz pokoj2 pokoj4 klucz3 zielony)
   deleted: (merrypozycja pokoj2) (merryklucz zielony klucz3)
   added: (merrypozycja pokoj4)
   goals met: 0 of 1
25. (przejdz pokoj4 pokoj6 klucz1 zolty)
   deleted: (merrypozycja pokoj4) (merryklucz zolty klucz1)
   added: (merrypozycja pokoj6)
   goals met: 0 of 1
26. (przejdz pokoj6 pokoj9 klucz2 fioletowy)
   deleted: (merrypozycja pokoj6) (merryklucz fioletowy klucz2)
   added: (merrypozycja pokoj9)
   goals met: 1 of 1
